"""Основные настройки игры"""
TITLE = "Hangar 18"
WIDTH = 1080
HEIGHT = 720
FPS = 60
FONT_NAME = 'impact'
hs_file = 'highscore.txt'


"""Расположение платформ"""
platform_list = [(0, HEIGHT - 48, 10000, 50),
                 (WIDTH//2, HEIGHT//2 + 100, 50, 10),
                 (WIDTH//2, HEIGHT//4 + 100, 50, 10),
                 (300, 350, 200, 10),
                 (1400, 100, 100, 10),
                 (1550, 250, 70, 10),
                 (1350, 500, 50, 10),
                 (1200, 350, 75, 10),
                 (1450, 400, 50, 10),
                 (1700, 360, 400, 5),
                 (2200, 300, 300, 5),
                 (1700, 520, 100, 160),
                 (0, 0, 100, 720),
                 (2350, 200, 30, 7),
                 (2350, 50, 30, 7),
                 (2350, -100, 30, 7),
                 (1800, -250, 600, 7),
                 (-250, -48, 50, 10),
                 (-500, -48, 50, 10),]


"""Цвета в RGB"""
WHITE = (255, 255, 255)
BLACK = (0, 0, 0)
RED = (255, 0, 0)
GREEN = (0, 255, 0)
BLUE = (0, 0, 255)
back_gr = (24, 0, 222)
orange = (255, 162, 0)

"""Дополнительные физические свойства игрока"""
player_ac = 0.8
player_friction = -0.1
player_grav = 1.15

